---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures
source: html/64cc3517-4042-e64d-8791-dc46f0b53e88.htm
---
# BuiltInFailures.AutoRouteFailures Properties

You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.